In [1]:
import pandas as pd

In [3]:
dict_data = {'a': 1, 'b': 2, 'c': 3}

sr = pd.Series(dict_data)

In [4]:
sr

a    1
b    2
c    3
dtype: int64

In [5]:
print(type(sr))

<class 'pandas.core.series.Series'>

In [6]:
print(sr)

a    1
b    2
c    3
dtype: int64

In [16]:
list_data = ['2021-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data, index=['date', 'Pi', 'Alphabet', 'num', 'bool'])

In [10]:
sr

date        2021-01-02
Pi                3.14
Alphabet           ABC
num                100
bool              True
dtype: object

In [11]:
print(type(sr['bool']))

<class 'bool'>

In [12]:
sr.values

array(['2021-01-02', 3.14, 'ABC', 100, True], dtype=object)

In [14]:
sr.index

Index(['date', 'Pi', 'Alphabet', 'num', 'bool'], dtype='object')

In [18]:
data = {'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]}

In [25]:
frame = pd.DataFrame(data, columns=['b', 'c', 'a', 'd'])

In [26]:
frame

   b  c  a    d
0  4  7  1  NaN
1  5  8  2  NaN
2  6  9  3  NaN

In [29]:
sr[[1, 2]]

Pi          3.14
Alphabet     ABC
dtype: object

In [30]:
sr[1:2]

Pi    3.14
dtype: object

In [31]:
sr['Pi':'Alphabet']

Pi          3.14
Alphabet     ABC
dtype: object

In [32]:
dict_data = {'c0': [1, 2, 3], 'c1':[4, 5, 6], 'c2':[7, 8, 9], 'c3':[10, 11, 12], 'c4':[13, 14, 15]}

In [33]:
df = pd.DataFrame(dict_data)

In [34]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [35]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], index=['준서','예은'], columns=['나이', '성별', '학교'])

In [37]:
df.T

     준서   예은
나이   15   17
성별    남    여
학교  덕영중  수리중

In [39]:
df.index=['학생1', '학생2']
df.columns=['연령', '남녀', '소속']

In [40]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [41]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], index=['준서','예은'], columns=['나이', '성별', '학교'])

In [42]:
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'}, inplace=True)

In [43]:
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [44]:
df.rename(index={'준서':'학생1', '예은':'학생2'}, inplace=True)

In [45]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [46]:
exam_data = {'수학': [90, 80, 70], '영어':[98, 89, 95], '음악':[85,95,100], '체육':[100, 90, 90]}

In [55]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

In [48]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [60]:
df2 = df[:]

In [61]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [62]:
df2.drop('우현', inplace=True)

/Users/jeonjeung-won/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [65]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [64]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [66]:
df3 = df[:]

In [67]:
df3.drop(['우현', '인아'], axis=0, inplace=True)

/Users/jeonjeung-won/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [68]:
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [69]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [70]:
df4 = df[:]

In [74]:
df4.drop('수학', axis='columns', inplace=True)

/Users/jeonjeung-won/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [76]:
df4.drop('영어', axis=1, inplace=True)

/Users/jeonjeung-won/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [77]:
df4

     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [78]:
df.loc['서준']

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [79]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [80]:
df.loc[['서준', '우현']]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [81]:
df[0]

KeyError: 0

In [87]:
df.loc['우현']

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [88]:
ㅇㄹ

NameError: name 'ᄋᄅ' is not defined

In [89]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [91]:
df.index

Index(['서준', '우현', '인아'], dtype='object')

In [92]:
exam_data = {'이름':['서준', '우현', '인아'], '수학':[90, 80, 70], '영어':[98, 89, 95], '음악':[85, 95, 100], '체육':[100, 90, 90]}

In [93]:
df = pd.DataFrame(exam_data)

In [94]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [96]:
df.set_index('이름', inplace=True)

In [97]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [98]:
df.loc['서준']

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [100]:
df.iloc[1, 2]

95

In [101]:
df.loc['서준', ['음악', '체육']]

음악     85
체육    100
Name: 서준, dtype: int64

In [102]:
df.loc[['서준', '우현'], ['음악', '체육']]

    음악   체육
이름
서준  85  100
우현  95   90

In [103]:
df['국어']=80

In [104]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [105]:
df.과학=100

In [106]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [107]:
df.loc['제리'] = 80

In [108]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
제리  80  80   80   80  80

In [110]:
df.iloc[0, 3] = 80

In [112]:
df

    수학  영어   음악  체육  국어
이름
서준  90  98   85  80  80
우현  80  89   95  90  80
인아  70  95  100  90  80
제리  80  80   80  80  80

In [116]:
df

    수학   영어   음악  체육  국어
이름
서준  90  100   98  80  80
우현  80   89   95  90  80
인아  70   95  100  90  80
제리  80   80   80  80  80

In [118]:
import pandas as pd
dict_data = {'c0': [1, 2, 3], 'c1':[4, 5, 6], 'c2':[7, 8, 9]}
df = pd.DataFrame(dict_data, index=['n + 1', 'n + 2', 'n'])
print(df)

       c0  c1  c2
n + 1   1   4   7
n + 2   2   5   8
n       3   6   9

In [119]:
exam_data = {'이름':['서준', '우현', '인아'],\
            '수학':[90, 80, 70],\
            '영어':[98, 89, 95],\
            '음악':[85, 95, 100],\
            '체육':[100, 90, 90]}

In [136]:
df = pd.DataFrame(exam_data)

In [121]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [122]:
ndf = df.set_index(['이름'])

In [123]:
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [124]:
ndf2 = ndf.set_index('수학')

In [125]:
ndf2

    영어   음악   체육
수학
90  98   85  100
80  89   95   90
70  95  100   90

In [130]:
ndf3 = df.set_index('수학', '음악')

In [131]:
ndf3

    이름  영어   음악   체육
수학
90  서준  98   85  100
80  우현  89   95   90
70  인아  95  100   90

In [134]:
df.

In [137]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [139]:
df.index=['a', 'b', 'c']

In [140]:
df

   이름  수학  영어   음악   체육
a  서준  90  98   85  100
b  우현  80  89   95   90
c  인아  70  95  100   90

In [141]:
dict_data = {'c0':[1, 2, 3],'c1':[4, 5, 6],\
             'c2':[7, 8, 9],'c3':[10, 11, 12],\
             'c4':[13, 14, 15]}

In [142]:
df = pd.DataFrame(dict_data)

In [151]:
df = df.rename(index={0:'r0', 1:'r1', 2:'r2'})

In [152]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [153]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']

In [154]:
ndf = df.reindex(new_index)

In [155]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [156]:
ndf2 = df.reindex(new_index, fill_value=0)

In [157]:
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [158]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [164]:
df = df.reset_index()

In [166]:
df = df.set_index('index')

In [167]:
ndf = df.sort_index(ascending=False)

In [168]:
ndf

       c0  c1  c2  c3  c4
index
r2      3   6   9  12  15
r1      2   5   8  11  14
r0      1   4   7  10  13

In [169]:
ndf = df.sort_values(by='c1', ascending=False)

In [170]:
ndf

       c0  c1  c2  c3  c4
index
r2      3   6   9  12  15
r1      2   5   8  11  14
r0      1   4   7  10  13

In [171]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})

In [173]:
student1

국어    100
영어     80
수학     90
dtype: int64

In [179]:
student2 = pd.Series({'수학':80,'국어':90, '과학':80})

In [175]:
student2

국어    80
영어    60
수학    70
dtype: int64

In [180]:
add = student1 + student2

In [181]:
add

과학      NaN
국어    190.0
수학    170.0
영어      NaN
dtype: float64

In [182]:
import numpy as np

In [183]:
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

In [184]:
student1 + student2

국어      NaN
수학    170.0
영어      NaN
dtype: float64

In [185]:
student1.add(student2, fill_value=0)

국어     90.0
수학    170.0
영어     80.0
dtype: float64

In [186]:
import seaborn as sns

In [187]:
titanic = sns.load_dataset('titanic')

In [188]:
titanic[:5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [189]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [191]:
titanic.shape

(891, 15)

In [193]:
titanic.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [196]:
df = titanic.loc[:, ['age','fare']]

In [197]:
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [198]:
df[:5]

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [199]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [200]:
type(df)

pandas.core.frame.DataFrame

In [201]:
add = df + 10

In [202]:
add.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [203]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [204]:
add.tail()

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75

      age      fare
0    54.0   24.5000
1    86.0  152.5666
2    62.0   25.8500
3    80.0  116.2000
4    80.0   26.1000
..    ...       ...
886  64.0   36.0000
887  48.0   70.0000
888   NaN   56.9000
889  62.0   70.0000
890  74.0   25.5000

[891 rows x 2 columns]